
## Plan Result (sbox)




<pre><code>Plan: 2 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.ai[0].azurerm_private_endpoint.cognitive_private_endpoint[0]
  * module.ai[0].azurerm_private_endpoint.foundry_private_endpoint[0]
* Update
  * module.ai[0].azurerm_storage_account.workspace_storage_account[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ai[0].azurerm_private_endpoint.cognitive_private_endpoint[0] will be created
  + resource "azurerm_private_endpoint" "cognitive_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "sds-cognitive-account-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "toffee-shared-infrastructure-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/iaas"
      + tags                     = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "managedBy"           = "Platform Operations"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.cognitiveservices.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "cognitive-account-psc"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/toffee-shared-infrastructure-sbox/providers/Microsoft.CognitiveServices/accounts/sds-cognitive-account-sbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "account",
            ]
        }
    }

  # module.ai[0].azurerm_private_endpoint.foundry_private_endpoint[0] will be created
  + resource "azurerm_private_endpoint" "foundry_private_endpoint" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "sds-ai-foundry-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "toffee-shared-infrastructure-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ss-sbox-network-rg/providers/Microsoft.Network/virtualNetworks/ss-sbox-vnet/subnets/iaas"
      + tags                     = {
          + "application"         = "core"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/sds-toffee-shared-infrastructure.git"
          + "businessArea"        = "Cross-Cutting"
          + "contactSlackChannel" = "#platops-help"
          + "environment"         = "sandbox"
          + "expiresAfter"        = "3000-01-01"
          + "managedBy"           = "Platform Operations"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.api.azureml.ms",
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.notebooks.azure.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ai-foundry-psc"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/toffee-shared-infrastructure-sbox/providers/Microsoft.MachineLearningServices/workspaces/sds-ai-foundry-sbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "amlworkspace",
            ]
        }
    }

  # module.ai[0].azurerm_storage_account.workspace_storage_account[0] will be updated in-place
  ~ resource "azurerm_storage_account" "workspace_storage_account" {
        id                                 = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/toffee-shared-infrastructure-sbox/providers/Microsoft.Storage/storageAccounts/sdstoffeesasbox"
        name                               = "sdstoffeesasbox"
        tags                               = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/sds-toffee-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "managedBy"           = "Platform Operations"
        }
        # (97 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":140,"Program":"tfcmt","SHA1":"","Target":"sbox","Vars":{}} -->